-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 12, 2026 at 09:12 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `presentation_generator`
--

-- --------------------------------------------------------

--
-- Table structure for table `presentations`
--

CREATE TABLE `presentations` (
  `id` int(11) NOT NULL,
  `workspace_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `language` varchar(10) DEFAULT 'bg',
  `theme` varchar(50) DEFAULT 'light',
  `version` varchar(50) DEFAULT NULL,
  `navigation_rules` text DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `presentations`
--

INSERT INTO `presentations` (`id`, `workspace_id`, `title`, `language`, `theme`, `version`, `navigation_rules`, `created_at`) VALUES
(1, 4, 'test2', 'bg', 'dark', NULL, NULL, '2025-06-06 00:09:46'),
(5, 7, 'Денис', 'bg', 'light', NULL, NULL, '2025-06-06 16:13:25'),
(7, 7, 'взв', 'bg', 'light', NULL, NULL, '2025-06-07 18:56:19'),
(11, 13, 'nova', 'bg', 'light', NULL, NULL, '2025-06-08 01:57:47'),
(12, 15, 'Презентация', 'bg', 'light', NULL, NULL, '2025-06-08 19:15:39'),
(13, 14, 'Презентация', 'bg', 'light', NULL, NULL, '2025-06-08 19:22:32'),
(14, 16, 'ada', 'bg', 'light', NULL, NULL, '2025-06-08 21:53:40'),
(15, 17, '1', 'bg', 'light', NULL, NULL, '2025-06-08 23:47:35'),
(16, 17, 'Презентация', 'bg', 'light', NULL, NULL, '2025-06-08 23:52:31'),
(17, 15, '', 'bg', 'light', NULL, NULL, '2025-06-09 12:39:18'),
(19, 19, 'html pr', 'bg', 'dark', NULL, NULL, '2025-06-09 12:44:20'),
(20, 19, 'Презентация', 'bg', 'dark', NULL, NULL, '2025-06-09 12:44:45'),
(23, 19, 'име', 'bg', 'barbie', NULL, NULL, '2025-06-09 23:52:50'),
(24, 20, 'barbie', 'bg', 'barbie', NULL, NULL, '2025-06-09 23:57:58'),
(25, 20, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-10 00:18:30'),
(26, 19, 'ken', 'bg', 'light', NULL, NULL, '2025-06-10 00:49:55'),
(27, 19, 'ken', 'bg', 'light', NULL, NULL, '2025-06-10 00:52:21'),
(28, 19, 'html pr', 'bg', 'light', NULL, NULL, '2025-06-10 01:02:48'),
(29, 19, 'html pr', 'bg', 'light', NULL, NULL, '2025-06-10 01:03:20'),
(30, 17, 'тест', 'bg', 'light', NULL, NULL, '2025-06-10 01:04:23'),
(31, 17, 'тест', 'bg', 'light', NULL, NULL, '2025-06-10 01:05:11'),
(32, 17, 'тест', 'bg', 'light', NULL, NULL, '2025-06-10 01:05:47'),
(114, 27, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-10 14:01:06'),
(115, 27, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-10 14:01:35'),
(116, 15, ',ld,ldc', 'bg', 'light', NULL, NULL, '2025-06-10 14:07:10'),
(118, 4, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-10 15:42:29'),
(119, 29, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-10 16:07:46'),
(120, 29, 'име', 'bg', 'dark', NULL, NULL, '2025-06-10 16:09:14'),
(121, 15, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-11 12:31:37'),
(122, 29, 'Презентация', 'bg', 'light', NULL, NULL, '2025-06-11 12:32:06'),
(123, 30, '566569+', 'bg', 'light', NULL, NULL, '2025-06-11 12:49:24'),
(124, 31, 'f', 'bg', 'light', NULL, NULL, '2025-06-11 13:16:12'),
(125, 31, 'Презентация', 'bg', 'light', NULL, NULL, '2025-06-11 20:30:25'),
(126, 31, 'ken', 'bg', 'ken', NULL, NULL, '2025-06-11 20:31:05'),
(127, 32, 'ken', 'bg', 'ken', NULL, NULL, '2025-07-01 14:58:20'),
(128, 32, 'Презентация', 'bg', 'light', NULL, NULL, '2025-07-01 15:00:12'),
(129, 33, 'тестова презентация', 'bg', 'light', NULL, NULL, '2026-01-05 13:31:53'),
(130, 33, 'ken', 'bg', 'ken', NULL, NULL, '2026-01-05 23:32:51'),
(131, 33, 'barbie', 'bg', 'barbie', NULL, NULL, '2026-01-05 23:40:18'),
(132, 33, 'ken', 'bg', 'ken', NULL, NULL, '2026-01-05 23:41:26'),
(133, 34, 'test_pr', 'bg', 'light', NULL, NULL, '2026-01-12 16:58:02');

-- --------------------------------------------------------

--
-- Table structure for table `slides`
--

CREATE TABLE `slides` (
  `id` int(11) NOT NULL,
  `presentation_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `slide_order` int(11) NOT NULL,
  `layout` varchar(50) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `slides`
--

INSERT INTO `slides` (`id`, `presentation_id`, `title`, `slide_order`, `layout`, `created_at`) VALUES
(6, 7, 'нднндн', 5, 'full', '2025-06-07 19:36:34'),
(7, 7, '5', 6, 'full', '2025-06-07 19:50:23'),
(8, 7, '1223', 7, 'full', '2025-06-07 19:53:37'),
(13, 5, '1', 1, 'full', '2025-06-08 01:52:19'),
(14, 5, '2', 2, 'full', '2025-06-08 01:52:21'),
(15, 5, '3', 3, 'full', '2025-06-08 01:52:22'),
(16, 1, '1', 1, 'full', '2025-06-08 01:52:45'),
(17, 11, '01', 1, 'full', '2025-06-08 01:57:58'),
(18, 11, 'Име', 2, 'full', '2025-06-08 12:46:36'),
(19, 11, 'Две колони', 3, 'two-columns', '2025-06-08 12:47:16'),
(20, 13, 'Заглавие на слайд', 1, 'full', '2025-06-08 19:39:55'),
(21, 13, 'Heading', 2, 'full', '2025-06-08 19:53:56'),
(22, 12, 'kkokoko', 1, 'full', '2025-06-08 19:58:50'),
(23, 13, 'test', 3, 'full', '2025-06-08 21:12:59'),
(24, 14, 'aaa', 1, 'full', '2025-06-08 21:53:52'),
(25, 15, '3', 3, 'full', '2025-06-08 23:47:46'),
(26, 15, '2', 2, 'full', '2025-06-08 23:47:51'),
(27, 15, '1', 1, 'full', '2025-06-08 23:47:58'),
(28, 16, 'kkokoko', 0, 'default', '2025-06-08 23:52:31'),
(29, 17, '', 0, 'default', '2025-06-09 12:39:18'),
(33, 20, 'kkokoko', 1, 'full', '2025-06-09 12:44:45'),
(35, 20, 'kjiji', 0, 'full', '2025-06-09 16:45:03'),
(36, 20, 'iijiji', 2, 'full', '2025-06-09 16:45:25'),
(37, 20, 'заглавие', 3, 'two-columns', '2025-06-09 17:43:19'),
(38, 20, 'kokosko', 4, 'full', '2025-06-09 21:50:40'),
(39, 20, 'гггг', 6, 'full', '2025-06-09 22:16:02'),
(40, 19, 'аъъааъааъ', 1, 'full', '2025-06-09 23:18:52'),
(41, 19, 'тест', 2, 'full', '2025-06-09 23:36:57'),
(48, 23, 'гкгкгккгк', 1, 'two-columns', '2025-06-09 23:53:17'),
(49, 24, '01', 1, 'full', '2025-06-09 23:59:23'),
(50, 24, '02', 2, 'full', '2025-06-10 00:00:10'),
(51, 25, 'Увод', 1, 'full', '2025-06-10 00:18:54'),
(52, 20, 'Кой е Кен?', 7, 'full', '2025-06-10 00:20:23'),
(53, 20, 'Кой е Кен? 2', 8, 'two-rows', '2025-06-10 00:21:30'),
(54, 20, 'Осъзнаване на Кен', 9, 'two-rows', '2025-06-10 00:22:18'),
(55, 25, 'Кой е Кен?', 2, 'two-rows', '2025-06-10 00:24:03'),
(56, 25, 'Кой е Кен? част 2', 3, 'two-rows', '2025-06-10 00:28:10'),
(57, 25, 'Kenough', 4, 'grid-2x2', '2025-06-10 00:30:24'),
(58, 25, 'Дълбочина ', 5, 'two-rows', '2025-06-10 00:40:30'),
(59, 25, 'Свързване с реалния живот', 6, 'full', '2025-06-10 00:42:54'),
(60, 25, 'Свързване с реалния живот част 2', 7, 'two-rows', '2025-06-10 00:43:28'),
(61, 25, 'Заключение', 8, 'full', '2025-06-10 00:44:29'),
(62, 25, 'Заключение част 2 ', 9, 'two-rows', '2025-06-10 00:45:47'),
(63, 26, 'Увод', 0, 'default', '2025-06-10 00:49:55'),
(64, 26, 'Кой е Кен?', 1, 'default', '2025-06-10 00:49:55'),
(65, 26, 'Кой е Кен? част 2', 2, 'default', '2025-06-10 00:49:55'),
(66, 26, 'Kenough', 3, 'default', '2025-06-10 00:49:55'),
(67, 26, 'Дълбочина ', 4, 'default', '2025-06-10 00:49:55'),
(68, 26, 'Свързване с реалния живот', 5, 'default', '2025-06-10 00:49:55'),
(69, 26, 'Свързване с реалния живот част 2', 6, 'default', '2025-06-10 00:49:55'),
(70, 26, 'Заключение', 7, 'default', '2025-06-10 00:49:55'),
(71, 26, 'Заключение част 2 ', 8, 'default', '2025-06-10 00:49:55'),
(72, 27, 'Увод', 0, 'default', '2025-06-10 00:52:21'),
(73, 27, 'Кой е Кен?', 1, 'default', '2025-06-10 00:52:21'),
(74, 27, 'Кой е Кен? част 2', 2, 'default', '2025-06-10 00:52:21'),
(75, 27, 'Kenough', 3, 'default', '2025-06-10 00:52:21'),
(76, 27, 'Дълбочина ', 4, 'default', '2025-06-10 00:52:21'),
(77, 27, 'Свързване с реалния живот', 5, 'default', '2025-06-10 00:52:21'),
(78, 27, 'Свързване с реалния живот част 2', 6, 'default', '2025-06-10 00:52:21'),
(79, 27, 'Заключение', 7, 'default', '2025-06-10 00:52:21'),
(80, 27, 'Заключение част 2 ', 8, 'default', '2025-06-10 00:52:21'),
(81, 28, 'аъъааъааъ', 0, 'default', '2025-06-10 01:02:48'),
(82, 28, 'тест', 1, 'default', '2025-06-10 01:02:48'),
(83, 29, 'аъъааъааъ', 0, 'default', '2025-06-10 01:03:20'),
(84, 29, 'тест', 1, 'default', '2025-06-10 01:03:20'),
(85, 30, 'н', 1, 'full', '2025-06-10 01:04:40'),
(86, 31, 'н', 0, 'default', '2025-06-10 01:05:11'),
(87, 32, 'н', 0, 'default', '2025-06-10 01:05:47'),
(232, 20, 'нсдндн', 10, 'full', '2025-06-10 09:54:54'),
(775, 114, 'Увод', 0, 'full', '2025-06-10 14:01:06'),
(776, 114, 'Кой е Кен?', 0, 'two-rows', '2025-06-10 14:01:06'),
(777, 114, 'Кой е Кен? част 2', 0, 'two-rows', '2025-06-10 14:01:06'),
(778, 114, 'Kenough', 0, 'grid-2x2', '2025-06-10 14:01:06'),
(779, 114, 'Дълбочина ', 0, 'two-rows', '2025-06-10 14:01:06'),
(780, 114, 'Свързване с реалния живот', 0, 'full', '2025-06-10 14:01:06'),
(781, 114, 'Свързване с реалния живот част 2', 0, 'two-rows', '2025-06-10 14:01:06'),
(782, 114, 'Заключение', 0, 'full', '2025-06-10 14:01:06'),
(783, 114, 'Заключение част 2 ', 0, 'two-rows', '2025-06-10 14:01:06'),
(784, 115, 'Увод', 1, 'full', '2025-06-10 14:01:35'),
(785, 115, 'Кой е Кен?', 2, 'two-rows', '2025-06-10 14:01:35'),
(786, 115, 'Кой е Кен? част 2', 3, 'two-rows', '2025-06-10 14:01:35'),
(787, 115, 'Kenough', 4, 'grid-2x2', '2025-06-10 14:01:35'),
(788, 115, 'Дълбочина ', 5, 'two-rows', '2025-06-10 14:01:35'),
(789, 115, 'Свързване с реалния живот', 6, 'full', '2025-06-10 14:01:35'),
(790, 115, 'Свързване с реалния живот част 2', 7, 'two-rows', '2025-06-10 14:01:35'),
(791, 115, 'Заключение', 8, 'full', '2025-06-10 14:01:35'),
(792, 115, 'Заключение част 2 ', 9, 'two-rows', '2025-06-10 14:01:35'),
(793, 116, 'пнпннпн', 1, 'full', '2025-06-10 14:10:21'),
(803, 118, 'Увод', 1, 'full', '2025-06-10 15:42:29'),
(804, 118, 'Кой е Кен?', 2, 'two-rows', '2025-06-10 15:42:29'),
(805, 118, 'Кой е Кен? част 2', 3, 'two-rows', '2025-06-10 15:42:29'),
(806, 118, 'Kenough', 4, 'grid-2x2', '2025-06-10 15:42:29'),
(807, 118, 'Дълбочина ', 5, 'two-rows', '2025-06-10 15:42:29'),
(808, 118, 'Свързване с реалния живот', 6, 'full', '2025-06-10 15:42:29'),
(809, 118, 'Свързване с реалния живот част 2', 7, 'two-rows', '2025-06-10 15:42:29'),
(810, 118, 'Заключение', 8, 'full', '2025-06-10 15:42:29'),
(811, 118, 'Заключение част 2 ', 9, 'two-rows', '2025-06-10 15:42:29'),
(812, 119, 'Увод', 0, 'full', '2025-06-10 16:07:46'),
(813, 119, 'Кой е Кен?', 0, 'two-rows', '2025-06-10 16:07:46'),
(814, 119, 'Кой е Кен? част 2', 0, 'two-rows', '2025-06-10 16:07:46'),
(815, 119, 'Kenough', 0, 'grid-2x2', '2025-06-10 16:07:46'),
(816, 119, 'Дълбочина ', 1, 'two-rows', '2025-06-10 16:07:46'),
(817, 119, 'Свързване с реалния живот', 3, 'full', '2025-06-10 16:07:47'),
(818, 119, 'Свързване с реалния живот част 2', 5, 'two-rows', '2025-06-10 16:07:47'),
(819, 119, 'Заключение', 9, 'full', '2025-06-10 16:07:47'),
(820, 119, 'Заключение част 2 ', 7, 'two-rows', '2025-06-10 16:07:47'),
(822, 121, 'Увод', 1, 'full', '2025-06-11 12:31:37'),
(823, 121, 'Кой е Кен?', 2, 'two-rows', '2025-06-11 12:31:37'),
(824, 121, 'Кой е Кен? част 2', 3, 'two-rows', '2025-06-11 12:31:37'),
(825, 121, 'Kenough', 4, 'grid-2x2', '2025-06-11 12:31:37'),
(826, 121, 'Дълбочина ', 5, 'two-rows', '2025-06-11 12:31:37'),
(827, 121, 'Свързване с реалния живот', 6, 'full', '2025-06-11 12:31:37'),
(828, 121, 'Свързване с реалния живот част 2', 7, 'two-rows', '2025-06-11 12:31:37'),
(829, 121, 'Заключение', 8, 'full', '2025-06-11 12:31:37'),
(830, 121, 'Заключение част 2 ', 9, 'two-rows', '2025-06-11 12:31:37'),
(832, 122, 'Heading', 0, 'full', '2025-06-11 12:32:06'),
(833, 122, 'test', 0, 'full', '2025-06-11 12:32:06'),
(834, 122, 'cccc', 1, 'grid-2x3', '2025-06-11 13:50:00'),
(835, 122, 'тест', 2, 'three-columns', '2025-06-11 17:51:24'),
(836, 122, 'тест', 3, 'three-columns', '2025-06-11 17:51:58'),
(837, 125, 'Heading', 1, 'full', '2025-06-11 20:30:25'),
(838, 125, 'test', 2, 'full', '2025-06-11 20:30:25'),
(839, 125, 'cccc', 3, 'grid-2x3', '2025-06-11 20:30:25'),
(840, 125, 'тест', 4, 'three-columns', '2025-06-11 20:30:25'),
(841, 125, 'тест', 5, 'three-columns', '2025-06-11 20:30:25'),
(842, 126, 'Увод', 1, 'full', '2025-06-11 20:31:05'),
(843, 126, 'Кой е Кен?', 2, 'two-rows', '2025-06-11 20:31:05'),
(844, 126, 'Кой е Кен? част 2', 3, 'two-rows', '2025-06-11 20:31:05'),
(845, 126, 'Kenough', 4, 'grid-2x2', '2025-06-11 20:31:05'),
(846, 126, 'Дълбочина ', 5, 'two-rows', '2025-06-11 20:31:05'),
(847, 126, 'Свързване с реалния живот', 6, 'full', '2025-06-11 20:31:05'),
(848, 126, 'Свързване с реалния живот част 2', 7, 'two-rows', '2025-06-11 20:31:05'),
(849, 126, 'Заключение', 8, 'full', '2025-06-11 20:31:05'),
(850, 126, 'Заключение част 2 ', 9, 'two-rows', '2025-06-11 20:31:05'),
(851, 126, 'mkok', 10, 'three-columns', '2025-06-11 20:45:37'),
(852, 127, 'Увод', 0, 'full', '2025-07-01 14:58:20'),
(853, 127, 'Кой е Кен?', 0, 'two-rows', '2025-07-01 14:58:20'),
(854, 127, 'Кой е Кен? част 2', 0, 'two-rows', '2025-07-01 14:58:20'),
(855, 127, 'Kenough', 0, 'grid-2x2', '2025-07-01 14:58:20'),
(856, 127, 'Дълбочина ', 0, 'two-rows', '2025-07-01 14:58:20'),
(857, 127, 'Свързване с реалния живот', 0, 'full', '2025-07-01 14:58:20'),
(858, 127, 'Свързване с реалния живот част 2', 0, 'two-rows', '2025-07-01 14:58:20'),
(859, 127, 'Заключение', 0, 'full', '2025-07-01 14:58:20'),
(860, 127, 'Заключение част 2 ', 0, 'two-rows', '2025-07-01 14:58:20'),
(861, 128, 'Heading', 1, 'full', '2025-07-01 15:00:12'),
(862, 128, 'test', 2, 'full', '2025-07-01 15:00:12'),
(863, 128, 'cccc', 3, 'grid-2x3', '2025-07-01 15:00:12'),
(864, 128, 'тест', 4, 'three-columns', '2025-07-01 15:00:13'),
(865, 128, 'тест', 5, 'three-columns', '2025-07-01 15:00:13'),
(866, 129, 'Първи слайд', 1, 'two-columns', '2026-01-05 13:32:35'),
(867, 129, 'Втори слайд', 2, 'full', '2026-01-05 13:32:57'),
(868, 129, 'Трети слайд', 3, 'full', '2026-01-05 13:33:37'),
(869, 130, 'Увод', 0, 'full', '2026-01-05 23:32:51'),
(870, 130, 'Кой е Кен?', 0, 'two-rows', '2026-01-05 23:32:51'),
(871, 130, 'Кой е Кен? част 2', 0, 'two-rows', '2026-01-05 23:32:51'),
(872, 130, 'Kenough', 0, 'grid-2x2', '2026-01-05 23:32:51'),
(873, 130, 'Дълбочина ', 0, 'two-rows', '2026-01-05 23:32:51'),
(874, 130, 'Свързване с реалния живот', 0, 'full', '2026-01-05 23:32:51'),
(875, 130, 'Свързване с реалния живот част 2', 0, 'two-rows', '2026-01-05 23:32:51'),
(876, 130, 'Заключение', 0, 'full', '2026-01-05 23:32:51'),
(877, 130, 'Заключение част 2 ', 0, 'two-rows', '2026-01-05 23:32:51'),
(878, 131, '01', 1, 'full', '2026-01-05 23:40:18'),
(879, 131, '02', 2, 'full', '2026-01-05 23:40:18'),
(880, 132, 'Увод', 1, 'full', '2026-01-05 23:41:26'),
(881, 132, 'Кен е супер', 2, 'two-rows', '2026-01-05 23:41:26'),
(882, 132, 'Кой е Кен? част 2', 3, 'two-rows', '2026-01-05 23:41:26'),
(883, 132, 'Kenough', 4, 'grid-2x2', '2026-01-05 23:41:26'),
(884, 132, 'Дълбочина ', 5, 'two-rows', '2026-01-05 23:41:26'),
(885, 132, 'Свързване с реалния живот', 6, 'full', '2026-01-05 23:41:26'),
(886, 132, 'Свързване с реалния живот част 2', 7, 'two-rows', '2026-01-05 23:41:26'),
(887, 132, 'Заключение', 8, 'full', '2026-01-05 23:41:26'),
(888, 132, 'Заключение част 2 ', 9, 'two-rows', '2026-01-05 23:41:26'),
(889, 133, 'slide 1', 2, 'full', '2026-01-12 16:58:14'),
(890, 133, 'slide 2', 3, 'full', '2026-01-12 16:58:25'),
(891, 133, 'slide 3', 1, 'grid-2x2', '2026-01-12 16:58:54');

-- --------------------------------------------------------

--
-- Table structure for table `slide_elements`
--

CREATE TABLE `slide_elements` (
  `id` int(11) NOT NULL,
  `slide_id` int(11) NOT NULL,
  `element_order` int(11) NOT NULL,
  `type` enum('text','image','image_text','image_list','list','quote') NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `content` text DEFAULT NULL,
  `text` text DEFAULT NULL,
  `style` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`style`)),
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `slide_elements`
--

INSERT INTO `slide_elements` (`id`, `slide_id`, `element_order`, `type`, `title`, `content`, `text`, `style`, `created_at`) VALUES
(6, 6, 0, 'text', 'ндднднд', 'ндндндндндн', NULL, '[]', '2025-06-07 19:36:34'),
(7, 7, 0, 'text', '', '', NULL, '[]', '2025-06-07 19:50:23'),
(8, 8, 0, 'image', '01', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2025-06-07 19:53:37'),
(16, 13, 0, 'text', '', '', NULL, '[]', '2025-06-08 01:52:19'),
(17, 14, 0, 'text', '', '', NULL, '[]', '2025-06-08 01:52:21'),
(18, 15, 0, 'text', '', '', NULL, '[]', '2025-06-08 01:52:22'),
(19, 16, 0, 'text', '01', '', NULL, '[]', '2025-06-08 01:52:45'),
(20, 17, 0, 'text', '01', 'kodkokd', NULL, '[]', '2025-06-08 01:57:58'),
(21, 18, 0, 'text', '01', 'ндананданнаедндоноеднедоне', NULL, '[]', '2025-06-08 12:46:36'),
(22, 19, 0, 'image_list', '01', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'списък \r\nсписък \r\nсписък', '[]', '2025-06-08 12:47:16'),
(23, 19, 1, 'text', '02', 'нднддд', NULL, '[]', '2025-06-08 12:47:16'),
(25, 21, 0, 'image', 'Cute panda', 'https://i.pinimg.com/736x/a2/c1/ac/a2c1acaebfbf7f17cdcf261b8b6bc1cb.jpg', NULL, '[]', '2025-06-08 19:53:56'),
(26, 22, 0, 'text', '', 'koekoeofkeo', NULL, '[]', '2025-06-08 19:58:50'),
(28, 24, 0, 'text', '', '', NULL, '[]', '2025-06-08 21:53:52'),
(30, 26, 0, 'text', 'lplpl', '[;[;[\r\n', NULL, '[]', '2025-06-08 23:47:51'),
(32, 25, 0, 'text', 'lpp', 'lplplp\n', '', '[]', '2025-06-08 23:48:04'),
(33, 27, 0, 'text', ';[;[', 'okoko', '', '[]', '2025-06-08 23:48:14'),
(34, 28, 0, 'text', NULL, 'koekoeofkeo', NULL, NULL, '2025-06-08 23:52:31'),
(39, 35, 0, 'image', 'снимка', 'https://www.bigfootdigital.co.uk/wp-content/uploads/2020/07/image-optimisation-scaled.jpg', '', '[]', '2025-06-09 16:54:00'),
(43, 37, 0, 'image', 'Снимка 1', 'https://www.bigfootdigital.co.uk/wp-content/uploads/2020/07/image-optimisation-scaled.jpg', '', '[]', '2025-06-09 17:43:39'),
(44, 37, 1, 'image_text', 'Снимка 2', 'https://cdn.pixabay.com/photo/2024/05/26/10/15/bird-8788491_1280.jpg', 'текст', '[]', '2025-06-09 17:43:39'),
(46, 33, 0, 'image_text', '', 'https://i.pinimg.com/736x/a2/c1/ac/a2c1acaebfbf7f17cdcf261b8b6bc1cb.jpg', 'koekoeofkeo', '[]', '2025-06-09 20:25:08'),
(47, 36, 0, 'image_text', 'okooko', 'https://www.bigfootdigital.co.uk/wp-content/uploads/2020/07/image-optimisation-scaled.jpg', 'съдържаниесъдържаниесъдържаниесъдържаниесъдържаниесъдържаниесъдържаниесъдържаниесъдържаниесъдържание', '[]', '2025-06-09 20:25:21'),
(48, 38, 0, 'quote', 'dcdcdcd', 'dcdcd', NULL, '[]', '2025-06-09 21:50:40'),
(49, 39, 0, 'image_list', 'dddг', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'ddd', '[]', '2025-06-09 22:16:02'),
(51, 40, 0, 'list', 'аъааъааа', '123', '', '[]', '2025-06-09 23:35:27'),
(52, 41, 0, 'list', '', 'рднднд', NULL, '[]', '2025-06-09 23:36:57'),
(60, 48, 0, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2025-06-09 23:53:17'),
(61, 48, 1, 'list', '', '1\r\n2\r\n3', NULL, '[]', '2025-06-09 23:53:17'),
(63, 50, 0, 'image_text', 'Коя е Барби?', 'https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p13472534_p_v8_am.jpg', 'Барби, умалително от Barbara, е популярна детска кукла. За първи път е пусната през 1959 г. в щата Уисконсин, САЩ. Нейна „майка“ е Рут Хандлер. Пълното име на Барби е Барбара Милисънт Робъртс.', '[]', '2025-06-10 00:00:10'),
(65, 52, 0, 'image', '', 'https://cdn.theatlantic.com/thumbor/yer40hpLTzN3nXHyKOSdlawZcJ8=/603x0:4203x2700/1200x900/media/img/mt/2023/07/ken_hr/original.jpg', NULL, '[]', '2025-06-10 00:20:23'),
(66, 53, 0, 'image', '', 'https://ychef.files.bbci.co.uk/1280x720/p0g20fkv.jpg', NULL, '[]', '2025-06-10 00:21:30'),
(67, 53, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\r\n\r\n', NULL, '[]', '2025-06-10 00:21:30'),
(68, 54, 0, 'image', '', 'https://deadline.com/wp-content/uploads/2023/12/ryan-gosling-ken-barbie.jpg', NULL, '[]', '2025-06-10 00:22:18'),
(69, 54, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.\r\n\r\n', NULL, '[]', '2025-06-10 00:22:18'),
(72, 51, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '[]', '2025-06-10 00:27:20'),
(81, 55, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '[]', '2025-06-10 00:35:40'),
(82, 55, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '[]', '2025-06-10 00:35:40'),
(85, 57, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '[]', '2025-06-10 00:37:26'),
(86, 57, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '[]', '2025-06-10 00:37:26'),
(87, 57, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '[]', '2025-06-10 00:37:26'),
(88, 57, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '[]', '2025-06-10 00:37:26'),
(91, 56, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '[]', '2025-06-10 00:38:17'),
(92, 56, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '[]', '2025-06-10 00:38:17'),
(95, 59, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', NULL, '[]', '2025-06-10 00:42:54'),
(98, 61, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', NULL, '[]', '2025-06-10 00:44:29'),
(99, 62, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.', NULL, '[]', '2025-06-10 00:45:47'),
(100, 62, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', NULL, '[]', '2025-06-10 00:45:47'),
(101, 60, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '[]', '2025-06-10 00:48:17'),
(102, 60, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '[]', '2025-06-10 00:48:17'),
(103, 63, 0, 'image', NULL, 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', NULL, NULL, '2025-06-10 00:49:55'),
(104, 64, 0, 'image', NULL, 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', NULL, NULL, '2025-06-10 00:49:55'),
(105, 64, 1, 'text', NULL, 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', NULL, NULL, '2025-06-10 00:49:55'),
(106, 65, 0, 'image', NULL, 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', NULL, NULL, '2025-06-10 00:49:55'),
(107, 65, 1, 'text', NULL, 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', NULL, NULL, '2025-06-10 00:49:55'),
(108, 66, 0, 'image', NULL, 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', NULL, NULL, '2025-06-10 00:49:55'),
(109, 66, 1, 'text', NULL, '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', NULL, NULL, '2025-06-10 00:49:55'),
(110, 66, 2, 'image', NULL, 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', NULL, NULL, '2025-06-10 00:49:55'),
(111, 66, 3, 'image', NULL, 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', NULL, NULL, '2025-06-10 00:49:55'),
(112, 67, 0, 'list', NULL, 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', NULL, NULL, '2025-06-10 00:49:55'),
(113, 68, 0, 'text', NULL, 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', NULL, NULL, '2025-06-10 00:49:55'),
(114, 69, 0, 'image', NULL, 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', NULL, NULL, '2025-06-10 00:49:55'),
(115, 70, 0, 'text', NULL, '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', NULL, NULL, '2025-06-10 00:49:55'),
(116, 71, 0, 'image', NULL, 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', NULL, NULL, '2025-06-10 00:49:55'),
(117, 72, 0, 'image', NULL, 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', NULL, NULL, '2025-06-10 00:52:21'),
(118, 73, 0, 'image', NULL, 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', NULL, NULL, '2025-06-10 00:52:21'),
(119, 73, 1, 'text', NULL, 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', NULL, NULL, '2025-06-10 00:52:21'),
(120, 74, 0, 'image', NULL, 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', NULL, NULL, '2025-06-10 00:52:21'),
(121, 74, 1, 'text', NULL, 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', NULL, NULL, '2025-06-10 00:52:21'),
(122, 75, 0, 'image', NULL, 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', NULL, NULL, '2025-06-10 00:52:21'),
(123, 75, 1, 'text', NULL, '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', NULL, NULL, '2025-06-10 00:52:21'),
(124, 75, 2, 'image', NULL, 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', NULL, NULL, '2025-06-10 00:52:21'),
(125, 75, 3, 'image', NULL, 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', NULL, NULL, '2025-06-10 00:52:21'),
(126, 76, 0, 'list', NULL, 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', NULL, NULL, '2025-06-10 00:52:21'),
(127, 77, 0, 'text', NULL, 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', NULL, NULL, '2025-06-10 00:52:21'),
(128, 78, 0, 'image', NULL, 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', NULL, NULL, '2025-06-10 00:52:21'),
(129, 79, 0, 'text', NULL, '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', NULL, NULL, '2025-06-10 00:52:21'),
(130, 80, 0, 'image', NULL, 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', NULL, NULL, '2025-06-10 00:52:21'),
(131, 81, 0, 'list', NULL, '123', NULL, NULL, '2025-06-10 01:02:48'),
(132, 82, 0, 'list', NULL, 'рднднд', NULL, NULL, '2025-06-10 01:02:48'),
(133, 83, 0, 'list', NULL, '123', NULL, NULL, '2025-06-10 01:03:20'),
(134, 84, 0, 'list', NULL, 'рднднд', NULL, NULL, '2025-06-10 01:03:20'),
(135, 85, 0, 'image_text', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'нннн', '[]', '2025-06-10 01:04:40'),
(332, 232, 0, 'image_list', 'Подзаглавие', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '1\r\n2\r\n3', '[]', '2025-06-10 09:54:54'),
(1045, 58, 0, 'image', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '', '[]', '2025-06-10 11:42:10'),
(1046, 58, 1, 'list', '', 'Не трябва да се сравняваме с другите\nВсеки човек има право на индивидуалност.', '', '[]', '2025-06-10 11:42:10'),
(1272, 775, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '{}', '2025-06-10 14:01:06'),
(1273, 776, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '{}', '2025-06-10 14:01:06'),
(1274, 776, 0, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '{}', '2025-06-10 14:01:06'),
(1275, 777, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '{}', '2025-06-10 14:01:06'),
(1276, 777, 0, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '{}', '2025-06-10 14:01:06'),
(1277, 778, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '{}', '2025-06-10 14:01:06'),
(1278, 778, 0, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '{}', '2025-06-10 14:01:06'),
(1279, 778, 0, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '{}', '2025-06-10 14:01:06'),
(1280, 778, 0, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '{}', '2025-06-10 14:01:06'),
(1281, 779, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '{}', '2025-06-10 14:01:06'),
(1282, 779, 0, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '{}', '2025-06-10 14:01:06'),
(1283, 780, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '{}', '2025-06-10 14:01:06'),
(1284, 781, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '{}', '2025-06-10 14:01:06'),
(1285, 781, 0, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '{}', '2025-06-10 14:01:06'),
(1286, 782, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '{}', '2025-06-10 14:01:06'),
(1287, 783, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.— Кен', '', '{}', '2025-06-10 14:01:06'),
(1288, 783, 0, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '{}', '2025-06-10 14:01:06'),
(1289, 784, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '[]', '2025-06-10 14:01:35'),
(1290, 785, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '[]', '2025-06-10 14:01:35'),
(1291, 785, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '[]', '2025-06-10 14:01:35'),
(1292, 786, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '[]', '2025-06-10 14:01:35'),
(1293, 786, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '[]', '2025-06-10 14:01:35'),
(1294, 787, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '[]', '2025-06-10 14:01:35'),
(1295, 787, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '[]', '2025-06-10 14:01:35'),
(1296, 787, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '[]', '2025-06-10 14:01:35'),
(1297, 787, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '[]', '2025-06-10 14:01:35'),
(1298, 788, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '[]', '2025-06-10 14:01:35'),
(1299, 788, 1, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '[]', '2025-06-10 14:01:35'),
(1300, 789, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '[]', '2025-06-10 14:01:35'),
(1301, 790, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '[]', '2025-06-10 14:01:35'),
(1302, 790, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '[]', '2025-06-10 14:01:35'),
(1303, 791, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '[]', '2025-06-10 14:01:35'),
(1304, 792, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.', '', '[]', '2025-06-10 14:01:35'),
(1305, 792, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '[]', '2025-06-10 14:01:35'),
(1306, 793, 0, 'text', '', '', NULL, '[]', '2025-06-10 14:10:21'),
(1324, 803, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '[]', '2025-06-10 15:42:29'),
(1325, 804, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '[]', '2025-06-10 15:42:29'),
(1326, 804, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '[]', '2025-06-10 15:42:29'),
(1327, 805, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '[]', '2025-06-10 15:42:29'),
(1328, 805, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '[]', '2025-06-10 15:42:29'),
(1329, 806, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '[]', '2025-06-10 15:42:29'),
(1330, 806, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '[]', '2025-06-10 15:42:29'),
(1331, 806, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '[]', '2025-06-10 15:42:29'),
(1332, 806, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '[]', '2025-06-10 15:42:29'),
(1333, 807, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '[]', '2025-06-10 15:42:29'),
(1334, 807, 1, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '[]', '2025-06-10 15:42:29'),
(1335, 808, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '[]', '2025-06-10 15:42:29'),
(1336, 809, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '[]', '2025-06-10 15:42:29'),
(1337, 809, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '[]', '2025-06-10 15:42:29'),
(1338, 810, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '[]', '2025-06-10 15:42:29'),
(1339, 811, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.', '', '[]', '2025-06-10 15:42:29'),
(1340, 811, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '[]', '2025-06-10 15:42:29'),
(1341, 812, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '{}', '2025-06-10 16:07:46'),
(1342, 813, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '{}', '2025-06-10 16:07:46'),
(1343, 813, 0, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '{}', '2025-06-10 16:07:46'),
(1344, 814, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '{}', '2025-06-10 16:07:46'),
(1345, 814, 0, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '{}', '2025-06-10 16:07:46'),
(1346, 815, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '{}', '2025-06-10 16:07:46'),
(1347, 815, 0, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '{}', '2025-06-10 16:07:46'),
(1348, 815, 0, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '{}', '2025-06-10 16:07:46'),
(1349, 815, 0, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '{}', '2025-06-10 16:07:46'),
(1350, 816, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '{}', '2025-06-10 16:07:47'),
(1351, 816, 0, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '{}', '2025-06-10 16:07:47'),
(1352, 817, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '{}', '2025-06-10 16:07:47'),
(1353, 818, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '{}', '2025-06-10 16:07:47'),
(1354, 818, 0, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '{}', '2025-06-10 16:07:47'),
(1355, 819, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '{}', '2025-06-10 16:07:47'),
(1356, 820, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.— Кен', '', '{}', '2025-06-10 16:07:47'),
(1357, 820, 0, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '{}', '2025-06-10 16:07:47'),
(1361, 49, 0, 'image_text', 'Защо Барби е толкова готина?', 'https://upload.wikimedia.org/wikipedia/commons/0/0b/Barbie_Logo.svg', 'ттнтнтнн', '[]', '2025-06-10 16:12:45'),
(1362, 20, 0, 'text', 'Подзаглавие', 'ddsssdds', '', '[]', '2025-06-11 12:30:13'),
(1363, 23, 0, 'text', '', 'ssddssdsdwdwwddw', '', '[]', '2025-06-11 12:30:20'),
(1364, 822, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '{}', '2025-06-11 12:31:37'),
(1365, 823, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '{}', '2025-06-11 12:31:37'),
(1366, 823, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '{}', '2025-06-11 12:31:37'),
(1367, 824, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '{}', '2025-06-11 12:31:37'),
(1368, 824, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '{}', '2025-06-11 12:31:37'),
(1369, 825, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '{}', '2025-06-11 12:31:37'),
(1370, 825, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '{}', '2025-06-11 12:31:37'),
(1371, 825, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '{}', '2025-06-11 12:31:37'),
(1372, 825, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '{}', '2025-06-11 12:31:37'),
(1373, 826, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '{}', '2025-06-11 12:31:37'),
(1374, 826, 1, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '{}', '2025-06-11 12:31:37'),
(1375, 827, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '{}', '2025-06-11 12:31:37'),
(1376, 828, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '{}', '2025-06-11 12:31:37'),
(1377, 828, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '{}', '2025-06-11 12:31:37'),
(1378, 829, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '{}', '2025-06-11 12:31:37'),
(1379, 830, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.— Кен', '', '{}', '2025-06-11 12:31:37'),
(1380, 830, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '{}', '2025-06-11 12:31:37'),
(1382, 832, 0, 'image', 'Cute panda', 'https://i.pinimg.com/736x/a2/c1/ac/a2c1acaebfbf7f17cdcf261b8b6bc1cb.jpg', '', '{}', '2025-06-11 12:32:06'),
(1383, 833, 0, 'text', '', 'ssddssdsdwdwwddw', '', '{}', '2025-06-11 12:32:06'),
(1403, 834, 0, 'text', 'gtgtt', 'tgtggt', NULL, '[]', '2025-06-11 13:50:00'),
(1404, 834, 1, 'image', 'tgtgtg', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2025-06-11 13:50:00'),
(1405, 834, 2, 'image_text', 's', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'dcddcddcd', '[]', '2025-06-11 13:50:00'),
(1406, 834, 3, 'image_list', 'd', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'd\r\nfgf\r\nhg', '[]', '2025-06-11 13:50:00'),
(1407, 834, 4, 'list', '', '1\r\n22\r\n3', NULL, '[]', '2025-06-11 13:50:00'),
(1408, 834, 5, 'quote', '', 'dddddd', NULL, '[]', '2025-06-11 13:50:00'),
(1409, 835, 0, 'text', '', 'аааа', NULL, '[]', '2025-06-11 17:51:24'),
(1410, 835, 1, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2025-06-11 17:51:24'),
(1411, 835, 2, 'quote', 'ааа', 'ааааа', NULL, '[]', '2025-06-11 17:51:24'),
(1418, 836, 0, 'text', '', 'уяяяяуяяяяуяяяяуяяяяуяяяяуяяяяуяяяя', '', '[]', '2025-06-11 17:52:53'),
(1419, 836, 1, 'image_text', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'оооо', '[]', '2025-06-11 17:52:53'),
(1420, 836, 2, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-06-11 17:52:53'),
(1421, 837, 0, 'image', 'Cute panda', 'https://i.pinimg.com/736x/a2/c1/ac/a2c1acaebfbf7f17cdcf261b8b6bc1cb.jpg', '', '{}', '2025-06-11 20:30:25'),
(1422, 838, 0, 'text', '', 'ssddssdsdwdwwddw', '', '{}', '2025-06-11 20:30:25'),
(1423, 839, 0, 'text', 'gtgtt', 'tgtggt', '', '[]', '2025-06-11 20:30:25'),
(1424, 839, 1, 'image', 'tgtgtg', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-06-11 20:30:25'),
(1425, 839, 2, 'image_text', 's', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'dcddcddcd', '[]', '2025-06-11 20:30:25'),
(1426, 839, 3, 'image_list', 'd', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'd\r\nfgf\r\nhg', '[]', '2025-06-11 20:30:25'),
(1427, 839, 4, 'list', '', '1\r\n22\r\n3', '', '[]', '2025-06-11 20:30:25'),
(1428, 839, 5, 'quote', '', 'dddddd', '', '[]', '2025-06-11 20:30:25'),
(1429, 840, 0, 'text', '', 'аааа', '', '[]', '2025-06-11 20:30:25'),
(1430, 840, 1, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-06-11 20:30:25'),
(1431, 840, 2, 'quote', 'ааа', 'ааааа', '', '[]', '2025-06-11 20:30:25'),
(1432, 841, 0, 'text', '', 'уяяяяуяяяяуяяяяуяяяяуяяяяуяяяяуяяяя', '', '[]', '2025-06-11 20:30:25'),
(1433, 841, 1, 'image_text', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'оооо', '[]', '2025-06-11 20:30:25'),
(1434, 841, 2, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-06-11 20:30:25'),
(1435, 842, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '[]', '2025-06-11 20:31:05'),
(1436, 843, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '[]', '2025-06-11 20:31:05'),
(1437, 843, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '[]', '2025-06-11 20:31:05'),
(1438, 844, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '[]', '2025-06-11 20:31:05'),
(1439, 844, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '[]', '2025-06-11 20:31:05'),
(1440, 845, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '[]', '2025-06-11 20:31:05'),
(1441, 845, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '[]', '2025-06-11 20:31:05'),
(1442, 845, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '[]', '2025-06-11 20:31:05'),
(1443, 845, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '[]', '2025-06-11 20:31:05'),
(1444, 846, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '[]', '2025-06-11 20:31:05'),
(1445, 846, 1, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '[]', '2025-06-11 20:31:05'),
(1446, 847, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '[]', '2025-06-11 20:31:05'),
(1447, 848, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '[]', '2025-06-11 20:31:05'),
(1448, 848, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '[]', '2025-06-11 20:31:05'),
(1449, 849, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '[]', '2025-06-11 20:31:05'),
(1450, 850, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.', '', '[]', '2025-06-11 20:31:05'),
(1451, 850, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '[]', '2025-06-11 20:31:05'),
(1452, 851, 0, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2025-06-11 20:45:37'),
(1453, 851, 1, 'text', '', 'kkooko', NULL, '[]', '2025-06-11 20:45:37'),
(1454, 851, 2, 'list', '', '1\r\n2\r\n3', NULL, '[]', '2025-06-11 20:45:37'),
(1455, 852, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '{}', '2025-07-01 14:58:20'),
(1456, 853, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '{}', '2025-07-01 14:58:20'),
(1457, 853, 0, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '{}', '2025-07-01 14:58:20'),
(1458, 854, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '{}', '2025-07-01 14:58:20'),
(1459, 854, 0, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '{}', '2025-07-01 14:58:20'),
(1460, 855, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '{}', '2025-07-01 14:58:20'),
(1461, 855, 0, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '{}', '2025-07-01 14:58:20'),
(1462, 855, 0, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '{}', '2025-07-01 14:58:20'),
(1463, 855, 0, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '{}', '2025-07-01 14:58:20'),
(1464, 856, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '{}', '2025-07-01 14:58:20'),
(1465, 856, 0, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '{}', '2025-07-01 14:58:20'),
(1466, 857, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '{}', '2025-07-01 14:58:20'),
(1467, 858, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '{}', '2025-07-01 14:58:20'),
(1468, 858, 0, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '{}', '2025-07-01 14:58:20'),
(1469, 859, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '{}', '2025-07-01 14:58:20'),
(1470, 860, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.— Кен', '', '{}', '2025-07-01 14:58:20'),
(1471, 860, 0, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '{}', '2025-07-01 14:58:20'),
(1472, 861, 0, 'image', 'Cute panda', 'https://i.pinimg.com/736x/a2/c1/ac/a2c1acaebfbf7f17cdcf261b8b6bc1cb.jpg', '', '{}', '2025-07-01 15:00:12'),
(1473, 862, 0, 'text', '', 'ssddssdsdwdwwddw', '', '{}', '2025-07-01 15:00:12'),
(1474, 863, 0, 'text', 'gtgtt', 'tgtggt', '', '[]', '2025-07-01 15:00:12'),
(1475, 863, 1, 'image', 'tgtgtg', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-07-01 15:00:12'),
(1476, 863, 2, 'image_text', 's', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'dcddcddcd', '[]', '2025-07-01 15:00:13'),
(1477, 863, 3, 'image_list', 'd', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'd\r\nfgf\r\nhg', '[]', '2025-07-01 15:00:13'),
(1478, 863, 4, 'list', '', '1\r\n22\r\n3', '', '[]', '2025-07-01 15:00:13'),
(1479, 863, 5, 'quote', '', 'dddddd', '', '[]', '2025-07-01 15:00:13'),
(1480, 864, 0, 'text', '', 'аааа', '', '[]', '2025-07-01 15:00:13'),
(1481, 864, 1, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-07-01 15:00:13'),
(1482, 864, 2, 'quote', 'ааа', 'ааааа', '', '[]', '2025-07-01 15:00:13'),
(1483, 865, 0, 'text', '', 'уяяяяуяяяяуяяяяуяяяяуяяяяуяяяяуяяяя', '', '[]', '2025-07-01 15:00:13'),
(1484, 865, 1, 'image_text', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', 'оооо', '[]', '2025-07-01 15:00:13'),
(1485, 865, 2, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', '', '[]', '2025-07-01 15:00:13'),
(1486, 866, 0, 'text', '', 'Това е текст без заглавие', NULL, '[]', '2026-01-05 13:32:35'),
(1487, 866, 1, 'list', 'Моят списък', '1\r\n2\r\n3\r\n4\r\n5', NULL, '[]', '2026-01-05 13:32:35'),
(1488, 867, 0, 'image', 'Картинка', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2026-01-05 13:32:57'),
(1489, 868, 0, 'quote', 'Nestle Lion', 'Не си ти когато си гладен', NULL, '[]', '2026-01-05 13:33:37'),
(1490, 869, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '{}', '2026-01-05 23:32:51'),
(1491, 870, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '{}', '2026-01-05 23:32:51'),
(1492, 870, 0, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '{}', '2026-01-05 23:32:51'),
(1493, 871, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '{}', '2026-01-05 23:32:51'),
(1494, 871, 0, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '{}', '2026-01-05 23:32:51'),
(1495, 872, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '{}', '2026-01-05 23:32:51'),
(1496, 872, 0, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '{}', '2026-01-05 23:32:51'),
(1497, 872, 0, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '{}', '2026-01-05 23:32:51'),
(1498, 872, 0, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '{}', '2026-01-05 23:32:51'),
(1499, 873, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '{}', '2026-01-05 23:32:51'),
(1500, 873, 0, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '{}', '2026-01-05 23:32:51'),
(1501, 874, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '{}', '2026-01-05 23:32:51'),
(1502, 875, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '{}', '2026-01-05 23:32:51'),
(1503, 875, 0, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '{}', '2026-01-05 23:32:51'),
(1504, 876, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '{}', '2026-01-05 23:32:51'),
(1505, 877, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.— Кен', '', '{}', '2026-01-05 23:32:51'),
(1506, 877, 0, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '{}', '2026-01-05 23:32:51'),
(1507, 878, 0, 'image', 'Защо Барби е толкова готина?', 'https://upload.wikimedia.org/wikipedia/commons/0/0b/Barbie_Logo.svg', '', '[]', '2026-01-05 23:40:18'),
(1508, 879, 0, 'image_text', 'Коя е Барби?', 'https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p13472534_p_v8_am.jpg', 'Барби, умалително от Barbara, е популярна детска кукла. За първи път е пусната през 1959 г. в щата Уисконсин, САЩ. Нейна „майка“ е Рут Хандлер. Пълното име на Барби е Барбара Милисънт Робъртс.', '[]', '2026-01-05 23:40:18'),
(1512, 882, 0, 'image', '', 'https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_4z3CpH8Gy1TmpneD4kxivUYlKIg0ulyTQYX3ptNLmeiXWZSLiB7wdrwXs_FEzsoSzSmys_BvbpdDOo8DAFmVfkcd_vmzyfAopYgWkJ2zcpZfti0_r4_TOlHnbosvD4KIF4gLgZ-8skFE5J8JRD_UFy-hgqmG938QN6J0E84roEP2b-pEQgLo/s676/ryan%20gosling%20shirtless%20barbie%201.gif', '', '[]', '2026-01-05 23:41:26'),
(1513, 882, 1, 'text', '', 'Но във филма от 2023 г., Ken претърпява трансформация. Той се сблъсква с въпроса: Кой съм аз извън Barbie? И това поставя началото на неговото търсене на себе си.', '', '[]', '2026-01-05 23:41:26'),
(1514, 883, 0, 'image', '', 'https://media.tenor.com/pJID7tBkW44AAAAM/ken-ough.gif', '', '[]', '2026-01-05 23:41:26'),
(1515, 883, 1, 'text', '', '\"Kenough\" е комбинация от \"Ken\" и \"enough\" – тоест \"Ken е достатъчен\".', '', '[]', '2026-01-05 23:41:26'),
(1516, 883, 2, 'image', '', 'https://teefury.com/cdn/shop/files/102275-art-file-color-whi_e3ed1a24-c430-4e99-bd09-437bbf6a33cb_650x650.jpg?v=1690566875', '', '[]', '2026-01-05 23:41:26'),
(1517, 883, 3, 'image', '', 'https://creations.mattel.com/cdn/shop/products/ceifjw9jookgvrixoxbc_47b5e288-1355-4466-94a1-eeb239139eb1.jpg?v=1708504092', '', '[]', '2026-01-05 23:41:26'),
(1518, 884, 0, 'image_text', '', 'https://media.tenor.com/j0WdCWCWxdQAAAAM/barbie-2023-barbie-movie-2023.gif', '\"Ken is Kenough\" ни напомня:', '[]', '2026-01-05 23:41:26'),
(1519, 884, 1, 'list', '', 'Че не трябва да се сравняваме с другите, за да се чувстваме значими.\r\nЧе всеки човек има право на индивидуалност.', '', '[]', '2026-01-05 23:41:26'),
(1520, 885, 0, 'text', '', 'Много хора – независимо от пол, възраст или произход – се борят със съмнения за собствената си стойност. Но посланието на Ken ни насърчава да погледнем в себе си и да кажем:', '', '[]', '2026-01-05 23:41:26'),
(1521, 886, 0, 'quote', '', '\"Аз съм достатъчен/достатъчна такъв какъвто съм.\"', '', '[]', '2026-01-05 23:41:26'),
(1522, 886, 1, 'image', '', 'https://i.makeagif.com/media/9-27-2023/R5Fpk5.gif', '', '[]', '2026-01-05 23:41:26'),
(1523, 887, 0, 'text', '', '\"Ken is Kenough\" може да звучи като мем или шега, но всъщност съдържа силен социален и психологически заряд. Това е послание за приемане, себеуважение и истинска свобода.\r\n', '', '[]', '2026-01-05 23:41:26'),
(1524, 888, 0, 'quote', 'Кен', 'Защото понякога, най-важното признание не е това, което идва отвън, а това, което си дадем сами.', '', '[]', '2026-01-05 23:41:26'),
(1525, 888, 1, 'image', '', 'https://gifcop.com/wp-content/uploads/barbie-ryan-gosling.gif', '', '[]', '2026-01-05 23:41:26'),
(1539, 880, 0, 'image', 'Кой е Кен?', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', '', '[]', '2026-01-07 00:50:00'),
(1540, 881, 0, 'image', '', 'https://cdn.shopify.com/s/files/1/0522/1610/3083/files/ken_480x480.gif?v=1691574795', '', '[]', '2026-01-07 19:16:56'),
(1541, 881, 1, 'text', '', 'Ken е добре познатата кукла и дългогодишен \"спътник\" на Barbie. Дълго време той е възприеман като второстепенен, почти незабележим герой – винаги в сянката на главната звезда.\n\n', '', '[]', '2026-01-07 19:16:56'),
(1543, 890, 0, 'image', 'Ken', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', NULL, '[]', '2026-01-12 16:58:25'),
(1544, 891, 0, 'image', '', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8PsV5VpeeInf83Gi07mN4Fqz5ueL6bj4Y0Q&s', NULL, '[]', '2026-01-12 16:58:54'),
(1545, 891, 1, 'image', '', 'https://i.pinimg.com/736x/2f/7d/3d/2f7d3df8754e679449ebf9f26a14b1b1.jpg', NULL, '[]', '2026-01-12 16:58:54'),
(1546, 891, 2, 'list', '', '1\r\n2\r\n3', NULL, '[]', '2026-01-12 16:58:54'),
(1547, 891, 3, 'quote', 'kp', 'jdijidjidjd', NULL, '[]', '2026-01-12 16:58:54'),
(1548, 889, 0, 'text', 'heading', 'content\nnew content\n', '', '[]', '2026-01-12 17:00:02');

-- --------------------------------------------------------

--
-- Table structure for table `themes`
--

CREATE TABLE `themes` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `css` text NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `is_global` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password_hash`, `created_at`) VALUES
(1, '123', 'deni.tinista@gmal.co', '$2y$10$WWJ2VDrAPR1gALcv59/iCuc6YkIaxp9Q1moM4IcOjLDjNwRM1Nnaq', '2025-06-03 23:40:57'),
(2, 'test_user', 'test@example.com', '$2y$10$IP6DZ.Yw/ajG5NEZQzq6EuPk6vctkbQa5/FIUuOijz9JdczOCkqRW', '2025-06-03 23:41:58'),
(4, 'share', 'share@with.me', '$2y$10$8kPgGF0fzr.3O7zxxDddhe.fqt6C/S24Cv0f50gvAQA04aMKHibt.', '2025-06-08 18:58:29'),
(5, 'denica.ra@abv.bg', 'denica.ra@abv.bg', '$2y$10$t64VlYh.qN0BKOVVkDh5ruJxRXTA1dOiqh1CZQptCc51aGS0Z5Xyi', '2025-06-08 21:53:13'),
(7, 'share2', 'share@with.me2', '$2y$10$XuQziSdQNq4IpC1frNzb6ugiWIuluyZUfb7dstIpmJi6yZOWNCa/O', '2025-07-01 14:55:33'),
(8, 'denitsa', 'denitsa.test@abv.bg', '$2y$10$lUx6DZUJcQjHTonNg1HYPeh12I.dmhvrT/ETtHX8sKUui5Xl50UvC', '2026-01-05 13:30:17'),
(9, 'test', 'test@example.coc', '$2y$10$KKAqN2LkwiiFEfhB5JANSe1korU3gQ83Btlxyvlk0o1gQeCYgwQWe', '2026-01-07 00:43:36'),
(11, 'dr', 'dr@abv.bg', '$2y$10$cezRN/y2wLK0G86r5VA/Fex3vrmQJKohoEjlnkSLFBeXJOdNrCkWy', '2026-01-12 16:53:56');

-- --------------------------------------------------------

--
-- Table structure for table `user_workspaces`
--

CREATE TABLE `user_workspaces` (
  `user_id` int(11) NOT NULL,
  `workspace_id` int(11) NOT NULL,
  `role` enum('owner','viewer') DEFAULT 'viewer'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_workspaces`
--

INSERT INTO `user_workspaces` (`user_id`, `workspace_id`, `role`) VALUES
(2, 4, 'owner'),
(2, 7, 'owner'),
(2, 13, 'owner'),
(2, 17, 'owner'),
(2, 19, 'owner'),
(2, 20, 'owner'),
(2, 27, 'owner'),
(2, 29, 'owner'),
(2, 32, 'viewer'),
(4, 14, 'owner'),
(4, 15, 'owner'),
(4, 29, 'viewer'),
(4, 31, 'owner'),
(5, 16, 'owner'),
(7, 32, 'owner'),
(8, 33, 'owner'),
(9, 33, 'viewer'),
(9, 34, 'owner'),
(11, 34, 'viewer');

-- --------------------------------------------------------

--
-- Table structure for table `workspaces`
--

CREATE TABLE `workspaces` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `workspaces`
--

INSERT INTO `workspaces` (`id`, `name`, `created_at`) VALUES
(1, 'test_workspace', '2025-06-03 23:56:12'),
(4, 'test_newName2', '2025-06-06 00:00:05'),
(7, 'Denis', '2025-06-06 16:12:54'),
(13, 'ново', '2025-06-08 01:55:11'),
(14, 'Deni', '2025-06-08 18:58:58'),
(15, 'Test2', '2025-06-08 19:11:33'),
(16, 'qdada', '2025-06-08 21:53:30'),
(17, '56', '2025-06-08 23:47:22'),
(19, 'html test', '2025-06-09 12:44:13'),
(20, 'barbie and ken', '2025-06-09 23:57:32'),
(27, 'test', '2025-06-10 14:00:53'),
(29, '2', '2025-06-10 16:07:32'),
(30, '565665', '2025-06-11 12:49:15'),
(31, 'Denis', '2025-06-11 12:57:12'),
(32, 'test ot share', '2025-07-01 14:55:57'),
(33, 'Ново работно място', '2026-01-05 13:30:58'),
(34, 'my_workspace', '2026-01-12 16:57:52');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `presentations`
--
ALTER TABLE `presentations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `workspace_id` (`workspace_id`);

--
-- Indexes for table `slides`
--
ALTER TABLE `slides`
  ADD PRIMARY KEY (`id`),
  ADD KEY `presentation_id` (`presentation_id`);

--
-- Indexes for table `slide_elements`
--
ALTER TABLE `slide_elements`
  ADD PRIMARY KEY (`id`),
  ADD KEY `slide_id` (`slide_id`);

--
-- Indexes for table `themes`
--
ALTER TABLE `themes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `user_workspaces`
--
ALTER TABLE `user_workspaces`
  ADD PRIMARY KEY (`user_id`,`workspace_id`),
  ADD KEY `workspace_id` (`workspace_id`);

--
-- Indexes for table `workspaces`
--
ALTER TABLE `workspaces`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `presentations`
--
ALTER TABLE `presentations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=134;

--
-- AUTO_INCREMENT for table `slides`
--
ALTER TABLE `slides`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=892;

--
-- AUTO_INCREMENT for table `slide_elements`
--
ALTER TABLE `slide_elements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1549;

--
-- AUTO_INCREMENT for table `themes`
--
ALTER TABLE `themes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `workspaces`
--
ALTER TABLE `workspaces`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `presentations`
--
ALTER TABLE `presentations`
  ADD CONSTRAINT `presentations_ibfk_1` FOREIGN KEY (`workspace_id`) REFERENCES `workspaces` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `slides`
--
ALTER TABLE `slides`
  ADD CONSTRAINT `slides_ibfk_1` FOREIGN KEY (`presentation_id`) REFERENCES `presentations` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `slide_elements`
--
ALTER TABLE `slide_elements`
  ADD CONSTRAINT `slide_elements_ibfk_1` FOREIGN KEY (`slide_id`) REFERENCES `slides` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `themes`
--
ALTER TABLE `themes`
  ADD CONSTRAINT `themes_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `user_workspaces`
--
ALTER TABLE `user_workspaces`
  ADD CONSTRAINT `user_workspaces_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_workspaces_ibfk_2` FOREIGN KEY (`workspace_id`) REFERENCES `workspaces` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
